After acquiring the Instagram datasets from Kaggle, we will extract the required information, check for null values and save the data under the [`output`](./output/) folder.

## Contents:
- [Loading of Libraries](#Loading-of-Libraries) 
- [Loading of Data and Cleaning](#Loading-of-Data-and-Cleaning)

## Loading of Libraries

In [1]:
# Imports
import pandas as pd
import numpy as np

## Loading of Data and Cleaning
- Extract the required columns
- Check null values and data types
- Drop rows with null values
- Save and export

#### Instagram posts data

In [2]:
# Load dataset
posts = pd.read_csv('../instagram-dataset/instagram_posts.csv', sep='\t')
print(posts.shape)
posts.head()

(42710197, 10)

,sid,sid_profile,post_id,profile_id,location_id,cts,post_type,description,numbr_likes,number_comments
0,28370919,3496776,BXdjjUlgcgq,2.237948e+09,1.022366e+15,2017-08-06 20:06:57.000,2,Wreckloose! Deevalley bike park laps on the @i...,80.0,0.0
1,28370932,-1,BVg0pbolYBC,5.579335e+09,4.574268e+14,2017-06-19 09:31:16.000,1,üôåüèº believe in ya dreams üôåüèº just like I believe...,25.0,1.0
2,28370933,-1,BRgkjcXFp3Q,3.134296e+08,4.574268e+14,2017-03-11 20:05:03.000,1,#meraviglia #incensi #the #candele #profumo #a...,9.0,0.0
3,28370934,-1,BKTKeNhjEA7,1.837593e+09,4.574268e+14,2016-09-13 16:27:16.000,1,#teatime #scorpion #friends #love #mountains #...,4.0,0.0
4,28370935,-1,8-NQrvoYLX,1.131527e+09,4.574268e+14,2015-10-18 10:19:27.000,1,thE sky gavE mE a #constEllation,8.0,0.0

In [3]:
# Extract 'profile_id', 'location_id', 'cts', 'description' columns
posts = posts[['profile_id', 'location_id', 'cts', 'description']]

In [4]:
# Check null values and data types
posts.info(show_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 42710197 entries, 0 to 42710196
Data columns (total 4 columns):
 #   Column       Non-Null Count     Dtype
---  ------       --------------     -----
 0   profile_id   40126905 non-null  float64
 1   location_id  29737425 non-null  float64
 2   cts          42706865 non-null  object
 3   description  38714789 non-null  object
dtypes: float64(2), object(2)
memory usage: 1.3+ GB

In [5]:
# Check null values
posts.isnull().sum()

profile_id      2583292
location_id    12972772
cts                3332
description     3995408
dtype: int64

In [6]:
# Check proportion of null values in 'profile_id' col
posts['profile_id'].isnull().sum() / len(posts)

0.06048419771980916

In [7]:
# Check proportion of null values in 'location_id' col
posts['location_id'].isnull().sum() / len(posts)

0.30373945594303864

In [8]:
# Check proportion of null values in 'cts' col
posts['cts'].isnull().sum() / len(posts)

7.801415666614696e-05

In [9]:
# Check proportion of null values in 'description' col
posts['description'].isnull().sum() / len(posts)

0.09354693447094145

For the purpose of this project, to enable collaborative filtering, we will need `profile_id` and `description` to find out user preference, and `location_id` to identify places of interest so null values will be dropped though they are more than 1% of the dataset. The proportion of null values in `cts` column is less than 1% of the dataset so it can be dropped.

In [10]:
# Drop null values
posts.dropna(inplace=True)

In [11]:
# Reset index
posts.reset_index(drop=True, inplace=True)

In [12]:
# Check that null values have been dropped
posts.info(show_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26430128 entries, 0 to 26430127
Data columns (total 4 columns):
 #   Column       Non-Null Count     Dtype
---  ------       --------------     -----
 0   profile_id   26430128 non-null  float64
 1   location_id  26430128 non-null  float64
 2   cts          26430128 non-null  object
 3   description  26430128 non-null  object
dtypes: float64(2), object(2)
memory usage: 806.6+ MB

In [13]:
posts.head()

,profile_id,location_id,cts,description
0,2.237948e+09,1.022366e+15,2017-08-06 20:06:57.000,Wreckloose! Deevalley bike park laps on the @i...
1,5.579335e+09,4.574268e+14,2017-06-19 09:31:16.000,üôåüèº believe in ya dreams üôåüèº just like I believe...
2,3.134296e+08,4.574268e+14,2017-03-11 20:05:03.000,#meraviglia #incensi #the #candele #profumo #a...
3,1.837593e+09,4.574268e+14,2016-09-13 16:27:16.000,#teatime #scorpion #friends #love #mountains #...
4,1.131527e+09,4.574268e+14,2015-10-18 10:19:27.000,thE sky gavE mE a #constEllation

In [14]:
# Save and export
posts.to_csv('./output/posts.csv', index=False)

#### Instagram locations data

In [16]:
# Load dataset
locations = pd.read_csv('../instagram-dataset/instagram_locations.csv', sep='\t')
print(locations.shape)
locations.head()

(1022658, 23)

,sid,id,name,street,zip,city,region,cd,phone,aj_exact_city_match,...,dir_city_name,dir_city_slug,dir_country_id,dir_country_name,lat,lng,primary_alias_on_fb,slug,website,cts
0,719981,110296492939207,"Playa de Daimuz - Valencia, Espa√±a",NaN,NaN,NaN,NaN,NaN,NaN,False,...,NaN,NaN,NaN,NaN,-0.139475,38.974391,daimuzplaya,playa-de-daimuz-valencia-espana,https://es.wikipedia.org/wiki/Daimuz,2019-05-29 01:21:29.987
1,719983,274391278,Nov√° Vieska,NaN,NaN,Nov√° Vieska,NaN,SK,NaN,True,...,Kis-√öjfalu,kis-ujfalu,SK,Slovakia,18.466667,47.866667,NaN,nova-vieska,NaN,2019-05-29 01:21:38.037
2,719985,148885595789195,Everest Today,Himalayas,+977,"Kathmandu, Nepal",NaN,NP,NaN,False,...,Pasupati,pasupati,NP,Nepal,85.330150,27.701960,EverestToday,everest-today,NaN,2019-05-29 01:21:46.295
3,719987,263258277,BULAC - Biblioth√®que universitaire des langues...,"65, rue des Grands-Moulins",75013,"Paris, France",NaN,FR,01 81 69 18 00,False,...,13√®me Arrondissement Paris,13eme-arrondissement-paris,FR,France,2.375995,48.827240,BULAC.Paris,bulac-bibliotheque-universitaire-des-langues-e...,www.bulac.fr,2019-05-29 01:21:54.355
4,326443,406147529857708,ABC Cable Networks Group,3800 W Alameda Ave,91505,"Burbank, California",NaN,US,(818) 569-7500,False,...,NaN,NaN,NaN,NaN,-118.341864,34.153265,NaN,abc-cable-networks-group,NaN,2019-04-02 15:22:55.703

In [17]:
# Extract 'id', 'city', 'cd', 'dir_country_name' columns
locations = locations[['id', 'name', 'city', 'cd', 'dir_country_name']]

In [18]:
# Check null values and data types
locations.info(show_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1022658 entries, 0 to 1022657
Data columns (total 5 columns):
 #   Column            Non-Null Count    Dtype
---  ------            --------------    -----
 0   id                1022658 non-null  int64
 1   name              1022658 non-null  object
 2   city              937166 non-null   object
 3   cd                939010 non-null   object
 4   dir_country_name  495698 non-null   object
dtypes: int64(1), object(4)
memory usage: 39.0+ MB

`cd` and `dir_country_name` columns are both country names. Since `cd` column has less null values, we will drop `dir_country_name` column.

In [19]:
# Extract 'id', 'city', 'cd' columns
locations = locations[['id','name', 'city', 'cd']]

In [20]:
# Check null values
locations.isnull().sum()

id          0
name        0
city    85492
cd      83648
dtype: int64

In [21]:
# Check proportion of null values in 'city' col
locations['city'].isnull().sum() / len(locations)

0.0835978401381498

In [22]:
# Check proportion of null values in 'cd' col
locations['cd'].isnull().sum() / len(locations)

0.08179469578294991

For this project, we will need the names of the cities and countries so the rows with null values will be dropped though the proportions of null values in `city` and `cd` columns are both more than 1%.

In [23]:
# Drop null values
locations.dropna(inplace=True)

In [24]:
# Reset index
locations.reset_index(drop=True, inplace=True)

In [25]:
# Check all changes
locations.info(show_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 937061 entries, 0 to 937060
Data columns (total 4 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   id      937061 non-null  int64
 1   name    937061 non-null  object
 2   city    937061 non-null  object
 3   cd      937061 non-null  object
dtypes: int64(1), object(3)
memory usage: 28.6+ MB

In [26]:
locations.head()

,id,name,city,cd
0,274391278,Nov√° Vieska,Nov√° Vieska,SK
1,148885595789195,Everest Today,"Kathmandu, Nepal",NP
2,263258277,BULAC - Biblioth√®que universitaire des langues...,"Paris, France",FR
3,406147529857708,ABC Cable Networks Group,"Burbank, California",US
4,1651686855080719,"Tampines, Singapore",Singapore,SG

In [27]:
# Save and export
locations.to_csv('./output/locations.csv', index=False)

##### Filter locations to the city of London only
- Check city names with 'London'
- Cross check the city of London with the country code 'GB'
- Rename the name of the city to standardise across the dataset
- Save and export

In [28]:
# Check city names with 'London'
# Check if the string contains a substring from the list
str1 = "London"
res = [string for string in list(locations['city'].unique()) if str1 in string]

print(res)

['London, United Kingdom', 'Londonderry, Northern Ireland', 'Londonderry, Ross County, Ohio', 'Larkswood, London', 'East London, Eastern Cape', 'London, Ontario', 'East Ham South, London', 'Purley, London', 'Eglinton, Londonderry, United Kingdom', 'Hanwell, London, United Kingdom', 'London, Kentucky', 'New London, New Hampshire', 'New London, Connecticut', 'Balham, London, England', 'Lady Margaret, London', 'London Colney', 'Sutton, London', 'New London, Wisconsin', 'Londonderry, Nova Scotia', 'Chinatown, London', 'Londonderry, New Hampshire', 'Hampton, London, United Kingdom', 'Wallington, London', 'London, Ohio', 'New London, Ohio', 'Creggan, Londonderry, United Kingdom', "Queen's Gate, London SW7", 'Londonderry, Vermont', 'Little London, Westmoreland, Jamaica', 'Cranford, London', 'Drumahoe, Londonderry, United Kingdom', 'Londoni, Central, Fiji', 'Custom House, London', 'South Londonderry, Vermont', 'New London, North Carolina', 'Bethnal Green South, London', 'Tottenham Green, London', 'North Londonderry, New Hampshire', 'Maida Vale, London, United Kingdom', 'Petersham, London', 'London, Arkansas', 'Westmount, London, Ontario', 'Highbury West, London', 'New London, Iowa', 'New London, Minnesota', 'Cove Rock, East London', 'New London, Indiana', 'Ardmore, County Londonderry', 'Nahoon Beach, East London', 'Woolwich Common, London', 'Hampton Hill, London, United Kingdom', "Figge's Marsh, London", 'Cornhill, London', 'Bromley Town, London', 'Campsie, Londonderry', 'Plaistow South, London', 'Cowley, London', 'Strawberry Hill, London', 'Downtown New London, Connecticut', 'Lime Street, London', "St Ann's, London", 'Endlebury, London', 'East London', 'North London', 'Blackheath Westcombe, London', 'Golborne, London', 'Hainault, London', 'Cremorne, London', 'South London', 'Seven Sisters, London', 'East Ham North, London', 'Fanshawe, London, Ontario', 'Stonebridge, London', 'Northcote, London', 'Sutton West, London', 'Newington, London']

In [29]:
# Cross check the city of London with the country code 'GB'
locations[locations['city']=='London, United Kingdom'].head()

,id,name,city,cd
15,845293065,North Wembley,"London, United Kingdom",GB
34,367398224,Heston Blumenthal at the Perfectionist's Cafe,"London, United Kingdom",GB
42,1178180,La Famiglia,"London, United Kingdom",GB
67,134002180597091,Brondesbury Medical Centre,"London, United Kingdom",GB
68,557445258066180,SingEasy West End,"London, United Kingdom",GB

These correspond to the locations in London, Great Britain, United Kingdom. The other rows containing 'London' in the 'city' columns will be checked. If they are in the UK, it will be renamed to 'London, United Kingdom'. If they are not in the UK, they will not be included for this project. To cross check the location further, we will search the location using 'id' on the Internet. For example, for ID=230466055, the url is https://www.instagram.com/explore/locations/230466055. We will also use Google Maps to cross-reference.

In [30]:
# Cross check the city of London with the country code 'GB'
locations[locations['city']=='Larkswood, London'].head()

             id               name               city  cd
2088  737465505  Larkswood, London  Larkswood, London  GB

In this instance, the name of the city will be renamed 'London, United Kingdom' for this place called Larks Wood in London.

In [31]:
# Cross check the city of London with the country code 'GB'
locations[locations['city']=='East London, Eastern Cape'].head()

               id                        name                       city  cd
3416    324435591   East London Guild Theatre  East London, Eastern Cape  ZA
17696   345230967  Life St Dominic's Hospital  East London, Eastern Cape  ZA
28429   474884067   Wild Coast Jikeleza Route  East London, Eastern Cape  ZA
58596   912393466                   Cambrigde  East London, Eastern Cape  ZA
61304  1020578280      Beacon Bay Retail Park  East London, Eastern Cape  ZA

In this instance, the above places are in South Africa so they will not be included for this project.

In [32]:
# Rename city names to selected ones
locations['city'].replace({'Larkswood, London': 'London, United Kingdom', 
                           'Purley, London': 'London, United Kingdom', 
                           'Hanwell, London, United Kingdom': 'London, United Kingdom', 
                           'Balham, London, England': 'London, United Kingdom',
                           'London Colney': 'London, United Kingdom', 
                           'Sutton, London': 'London, United Kingdom', 
                           'Chinatown, London': 'London, United Kingdom', 
                           'Hampton, London, United Kingdom': 'London, United Kingdom', 
                           'Wallington, London': 'London, United Kingdom', 
                           'Custom House, London': 'London, United Kingdom', 
                           'Bethnal Green South, London': 'London, United Kingdom', 
                           'Tottenham Green, London': 'London, United Kingdom', 
                           'Maida Vale, London, United Kingdom': 'London, United Kingdom', 
                           'Petersham, London': 'London, United Kingdom', 
                           'Highbury West, London': 'London, United Kingdom', 
                           'Woolwich Common, London': 'London, United Kingdom', 
                           'Hampton Hill, London, United Kingdom': 'London, United Kingdom', 
                           "Figge's Marsh, London": 'London, United Kingdom', 
                           'Cornhill, London': 'London, United Kingdom', 
                           'Bromley Town, London': 'London, United Kingdom', 
                           'Plaistow South, London': 'London, United Kingdom', 
                           'Cowley, London': 'London, United Kingdom', 
                           'Strawberry Hill, London': 'London, United Kingdom', 
                           'Lime Street, London': 'London, United Kingdom', 
                           "St Ann's, London": 'London, United Kingdom', 
                           'Endlebury, London': 'London, United Kingdom', 
                           'Blackheath Westcombe, London': 'London, United Kingdom', 
                           'Golborne, London': 'London, United Kingdom', 
                           'Hainault, London': 'London, United Kingdom', 
                           'Cremorne, London': 'London, United Kingdom', 
                           'Seven Sisters, London': 'London, United Kingdom', 
                           'East Ham North, London': 'London, United Kingdom', 
                           'Stonebridge, London': 'London, United Kingdom', 
                           'Northcote, London': 'London, United Kingdom', 
                           'Sutton West, London': 'London, United Kingdom', 
                           'Newington, London': 'London, United Kingdom'}, inplace=True)

In [33]:
# Check city names with 'London'
# Check if the string contains a substring from the list
str1 = "London"
res = [string for string in list(locations['city'].unique()) if str1 in string]

print(res)

['London, United Kingdom', 'Londonderry, Northern Ireland', 'Londonderry, Ross County, Ohio', 'East London, Eastern Cape', 'London, Ontario', 'East Ham South, London', 'Eglinton, Londonderry, United Kingdom', 'London, Kentucky', 'New London, New Hampshire', 'New London, Connecticut', 'Lady Margaret, London', 'New London, Wisconsin', 'Londonderry, Nova Scotia', 'Londonderry, New Hampshire', 'London, Ohio', 'New London, Ohio', 'Creggan, Londonderry, United Kingdom', "Queen's Gate, London SW7", 'Londonderry, Vermont', 'Little London, Westmoreland, Jamaica', 'Cranford, London', 'Drumahoe, Londonderry, United Kingdom', 'Londoni, Central, Fiji', 'South Londonderry, Vermont', 'New London, North Carolina', 'North Londonderry, New Hampshire', 'London, Arkansas', 'Westmount, London, Ontario', 'New London, Iowa', 'New London, Minnesota', 'Cove Rock, East London', 'New London, Indiana', 'Ardmore, County Londonderry', 'Nahoon Beach, East London', 'Campsie, Londonderry', 'Downtown New London, Connecticut', 'East London', 'North London', 'South London', 'Fanshawe, London, Ontario']

In [34]:
# Extract rows for London city only
city_london = locations[locations['city']=='London, United Kingdom']

In [35]:
# Reset index
city_london.reset_index(drop=True, inplace=True)

In [36]:
city_london.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20347 entries, 0 to 20346
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      20347 non-null  int64
 1   name    20347 non-null  object
 2   city    20347 non-null  object
 3   cd      20347 non-null  object
dtypes: int64(1), object(3)
memory usage: 636.0+ KB

In [37]:
city_london.head()

,id,name,city,cd
0,845293065,North Wembley,"London, United Kingdom",GB
1,367398224,Heston Blumenthal at the Perfectionist's Cafe,"London, United Kingdom",GB
2,1178180,La Famiglia,"London, United Kingdom",GB
3,134002180597091,Brondesbury Medical Centre,"London, United Kingdom",GB
4,557445258066180,SingEasy West End,"London, United Kingdom",GB

In [38]:
# Save and export
city_london.to_csv('./output/city_london.csv', index=False)

- There are a lot of 'London' in the world, especially in the US and South Africa.
- Several locations in London are not saved with an appropriate city name, as some include the name of the neighbourhood, street or road.
- Thus, the city name has been renamed to 'London, United Kingdom' to standardise across the dataset and the 'city_london.csv' file contains the locations in the city of London, UK only.
- We will have to check the names of the locations in London as they might not be standardised as well.